backend/controllers/JudgementController.php

    public function actionCreate()
    {
        $model = new Judgement();
//        print_r(Yii::$app->user->id);

        if ($model->load(Yii::$app->request->post()) && $model->save()) {
---
INSERT INTO `test_judgement` (`title`, `answer`, `admin_id`, `create_time`, `update_time`, `score`) VALUES ('挖掘机进行各种操作时,均应发出警告信号。', '1', 8, 1521558328, 1521558328, 5)