backend/views/judgement/index.php

                    'contentOptions' => ['width' => '50px'],
            ],
//            'admin_id',
            [
                    'attribute' => 'admin_id',
                    'value' => 'admin.username',
                    'contentOptions' => ['width' => '40px'],
                    'filter' => \backend\models\Adminuser::find()
                    ->select(['username'])
                    ->indexBy('id')
                    ->column(),
            ],
---
SELECT `username`, `test_adminuser`.`id` FROM `test_adminuser`