frontend/controllers/ResultController.php

            $result->is_real = $is_real;
            $result->score = 0;
            $result->user_id = Yii::$app->user->id;
            $result->save();
---
INSERT INTO `test_result` (`is_real`, `score`, `user_id`, `create_time`) VALUES ('1', 0, 4, 1521647769)

                    }
                    $judgementform->save();

                    if ($judgementform->judgement_answer == Judgement::findOne($shuffleJudgeIDs[$i]['id'])->answer){
---
SELECT EXISTS(SELECT * FROM `test_judgement` WHERE (`test_judgement`.`id`='63'))

                        $choiceform->choice_answer = '0';
                    }
                    $choiceform->save();
                    if ($choiceform->choice_answer == Choice::findOne($shuffleChoiceIDs[$i]['id'])->answer)
---
SELECT EXISTS(SELECT * FROM `test_choice` WHERE (`test_choice`.`id`='15'))

    public function actionJudgement()
    {
        Yii::$app->user->setReturnUrl(Yii::$app->request->referrer);
        $result = new Result();

        $queryID = Yii::$app->db->createCommand('SELECT id from test_judgement')->queryAll();
        shuffle($queryID);
        $how_mangJudgement = 10;
        $shuffleIDs = array_slice($queryID, 0, $how_mangJudgement);
        $judgementforms = [new Judgementpaper()];
        for ($i = 0; $i < $how_mangJudgement - 1; $i++) {
            $judgementforms[] = new Judgementpaper();
            $judgementforms[$i]->judgement_id = $shuffleIDs[$i]['id'];
        }
        $user_score = 0;
        $transaction = Yii::$app->db->beginTransaction();
        try {
            $result->score = 0;
            $result->user_id = Yii::$app->user->id;
            $result->save();
---
INSERT INTO `test_result` (`score`, `user_id`, `create_time`) VALUES (0, 4, 1521554206)