backend/views/choice/index.php

SELECT `username`, `test_adminuser`.`id` FROM `test_adminuser`
---
                'value' => 'admin.username',
                'contentOptions' => ['width'=>'140px','prompt'=>'全部'],

                'filter' => \backend\models\Adminuser::find()
                ->select(['username'])
                ->indexBy('id')
                ->column(),